//FIGGIS   JOB  'DS CREATE',
//      CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//         EXEC PGM=IEFBR14
//FOO      DD   DSN=WNDL.FOO,
//      DISP=(NEW,CATLG),
//      DCB=(RECFM=FB,LRECL=80,BLKSIZE=400),
//      UNIT=SYSDA,SPACE=(TRK,(50,10,10))
//
