//FIGGIS   JOB  'DS CREATE',
//      CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//         EXEC PGM=IEFBR14
//FOO      DD   DSN=WNDL.DATA.RND1,
//      DISP=(NEW,CATLG),
//      DCB=(RECFM=V,LRECL=80,BLKSIZE=960),
//      UNIT=SYSDA,SPACE=(TRK,(3,3))
//
