//FIGGIS   JOB 'LIST',
//     CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//STEP1    EXEC   PGM=IEHLIST
//VOLDD    DD     UNIT=SYSDA,VOL=SER=PUB002,DISP=OLD
//SYSPRINT DD     SYSOUT=A
//SYSIN    DD     *
  LISTPDS   DSN=(WNDL.FOO),VOL=SYSDA=PUB002,FORMAT
/*
//
