//***********************************************************************
//* ASSEMBLE TO OBJECT LIBRARY
//*
//%STPNAME      EXEC ASMFC
//ASM.SYSUT1    DD   UNIT=SYSDA
//ASM.SYSUT2    DD   UNIT=SYSDA
//ASM.SYSUT3    DD   UNIT=SYSDA
//ASM.SYSPUNCH  DD   DSN=%PDS(%MEM),DISP=MOD
//ASM.SYSIN     DD   *
