//FIGGIS   JOB   'DS DELETE',
//      CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//         EXEC  PGM=IEFBR14
//FOO      DD    DSN=WNDL.FOO,DISP=(OLD,DELETE)
//
