//***********************************************************************
//* DELETE DATA SET
//*
//%STPNAME   EXEC  PGM=IEFBR14
//DOOMED     DD    DSN=%DSN,
//      DISP=(OLD,DELETE),
//      UNIT=SYSDA,VOL=SER=%VOLSER

