//FIGGIS   JOB  'DS POPULATE',
//      CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//         EXEC PGM=IEBGENER
//SYSIN    DD   *
  GENERATE MAXFLDS=1
  RECORD FIELD=(16,1,,1)
//SYSPRINT DD   SYSOUT=A
//SYSUT1   DD   *
BORKO
BORKO
BORKO
BORKO
BORKO
BORKO
BORKO
BORKO
BORKO
BORKO
BORKO
BORKO
BORKO
BORKO
BORKO
BORKO
BORKO
BORKO
/*
//SYSUT2   DD   DSN=WNDL.BAR(TEST1),DISP=SHR
//
