//FIGGIS   JOB  'DS POPULATE',
//      CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//         EXEC PGM=IEBGENER
//SYSIN    DD   *
  GENERATE MAXFLDS=1
  RECORD FIELD=(16,1,,1)
//SYSPRINT DD   SYSOUT=A
//SYSUT1   DD   *
  2.71
  0.
  3.14
121.5
  9.81
 32.2
//SYSUT2   DD   DSN=WNDL.DATA.RND1,
//      DISP=(NEW,CATLG),
//      DCB=(RECFM=FB,LRECL=16,BLKSIZE=80),
//      UNIT=SYSDA,SPACE=(TRK,(1,1),RLSE)
//
