//CREAT    JOB    'PDS CREATE',
//      CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//         EXEC  PGM=IEFBR14
//PDS      DD    DSN=WNDL.FOO,DISP=(NEW,CATLG),
//      DCB=(RECFM=FB,LRECL=80,BLKSIZE=400,DSORG=PO),
//      UNIT=SYSDA,SPACE=(TRK,(50,20,5))
//
